#include "map.h"

/************************************************************
*************************************************************

Map类用来加载地图

功能：
 - 加载地图的色块
 - 根据给的比例尺参数进行缩放
 - 给地图色块染色（render类）

*************************************************************
************************************************************/


using namespace std;

class mapInit
{
private:
    /* data */
public:
    mapInit(/* args */);
    ~mapInit();
};

mapInit::mapInit(/* args */)
{
    cout<<"新建map对象"<<endl;
}

mapInit::~mapInit()
{
    cout<<"销毁map对象"<<endl;
}
